#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:nil p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:nil todo:t |:t
#+TITLE: Metaproject Project
#+DATE: <2016-02-29 05:01:34 Monday>
#+AUTHOR: George M Jones
#+EMAIL: gmj@pobox.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.1.50.1 (Org mode 8.3.4)

* Info and Planning - Metaproject 				:cogita:OODa:
** DONE Write up project description
   [2016-02-28 Sun]
   [[file:README.org]]
** TODO Figure out how to handle differing scopes within files and projects
   - Current setup assumes a project is the unit of granularity for
     access control.
** Experiment with tags
   - [X] Are tags inherited ? YES
   - [X] Are tags case sensitive? NO
   - [ ] "cogita,fac,dic" for my way of working
   - [ ] Do my projects fit OODA loop
** Experiment with order of top level headlines
   - [X] Possibly follow cogita, fac, dic order
   - [X] "Info" becomes "Info and Planning" and goes first
   - [X] "Meetings" becomes "Communication" to cover things like
     email, conversations, etc.   Which would mean meetings for
     planning could fall under "Info and Plannning"
   
* Action Items - Metaproject					   :fac:oodA:
** DONE Rename THIS file and categorize it in the new system
   SCHEDULED: <2016-02-27 Sat>
** IN-PROGRESS select git repos
   :LOGBOOK:
   CLOCK: [2016-02-27 Sat 06:16]--[2016-02-27 Sat 06:16] =>  0:00
   :END:
   [2016-02-27 Sat 06:16]
   [[file:~/projects][file:~/projects]]
** TODO Start re-organizing all my projects/git repos along these lines
** IN-PROGRESS Migrate ~/projects and ~/git projects to new format as I touch files
   :LOGBOOK:
   CLOCK: [2016-02-27 Sat 06:15]--[2016-02-27 Sat 06:15] =>  0:00
   :END:
   [2016-02-27 Sat 06:15]
   [[file:~/projects][file:~/projects]]
** TODO start syncing incrementally to new git repos
   :LOGBOOK:
   CLOCK: [2016-02-27 Sat 07:17]--[2016-02-27 Sat 07:17] =>  0:00
   :END:
   [2016-02-27 Sat 07:17]
   [[file:~/home/private/.ssh/install.sh][file:~/home/private/.ssh/install.sh]]
** TODO sync everything with my org dashboard
   :LOGBOOK:
   CLOCK: [2016-02-27 Sat 06:16]--[2016-02-27 Sat 06:16] =>  0:00
   :END:
   [2016-02-27 Sat 06:16]
   [[file:~/projects][file:~/projects]]
** TODO figure out what to to do with ~/secrets and ~/configs	       :oodA:

* Reporting - Metaproject 				    :dic:Ooda:footag:
** DONE Check this meta-project into github


